"""
Sample gender/kanji data. This has not currently been integrated into
the ML model, but is useful for sanity checking.
"""

# First two rows are popular ones, 3 are 個性的, rest are supplementary
male_tomeji = """
河（が）　樹（き）　輝（き）　吾（ご）　士（し）　志（し）　介（すけ）
星（せい）　太（た）　大（だい）　人（と）　翔（と）
斗（と）　陽（ひ）　広（ひろ）　平（へい）　馬（ま）　也（や）　郎（ろう）　朗（ろう）
市（いち）　庵（あん）　恩（おん）　朔（さく）　多（た）　壮（と）
堂（どう）　武（む）　夢（む）　門（もん）　矢（や）　嵐（らん）　琉（る）　楼（ろう）
晶（あき）　章（あき）　明（あき）　彰（あき）　晃（あき）　吉（きち）　国（くに）
佑（すけ）　信（のぶ）　成（なり）　長（なが）　永（なが）　宗（むね）
祐（すけ）　助（すけ）　男（お）　夫（お）　雄（お）　生（お）　哉（や）　也（や）
吉（きち）　也（や）　彦（ひこ）　信（のぶ）
"""

# Ditto
female_tomeji = """
愛（あ）　衣（い）　羽（う）　絵（え）　緒（お）　音（おん、ね）
花（か）　夏（か）　子（こ）　沙（さ）　月（つき）　菜（な）
奈（な）　乃（の）　穂（ほ）　帆（ほ）　美（み）　莉（り）　里（り）　優（ゆ）
杏（あん）　晏（あん）　丘（おか）　架（か）　祈（き）　瑚（こ）
祢（ね）　野（の）　芭（は）　心（み）　見（み）　芽（め）　蘭（らん）　恋（れん）
代（よ）　鈴（すず）　江（え）　恵（え）　華（か）　菜（な）　奈（な）　里（り）
"""

neutral_tomeji = """
央（お）　生（い）　音（おん）　希（き）　世（せ）　真（ま）　海（み）
"""

male_kanji = """
力　丈　大　之　牙　介　太　夫
巨　允　平　匠　俉　亘　丞　我
児　助　臣　男　努　辰　虎　侍
武　孟　門　昂　岳　威　彦　勇
郎　恒　柾　昴　岳　剣　拳　剛
造　致　馬　将　悟　寅　強　砦
紳　舵　逞　兜　彪　務　猛　凱
敢　雄　嵐　塁　鉱　獅　鉄　魁
綱　豪　錬　勲　駿　護　鷹　鷲

正　健　勝　信
"""

female_kanji = """
乃　女　子　朱　衣　妃　百
杏　花　芙　苑　苺　采　奈
茉　香　娃　美　桜　華　珠
姫　雫　梅　恋　栞　莉　梓
彩　菖　梢　菜　菫　毬　萌
椛　緑　琴　舞　穂　織　霞
瞳　鞠　雛　蘭　麗

愛　幸　華　美
"""
